head	1.2;
access;
symbols
	ansi-20040405-merged:1.1
	postmerge-20040405-ansi:1.1
	premerge-20040404-ansi:1.1
	postmerge-autoconf:1.1
	autoconf-freeze:1.1
	premerge-autoconf:1.1
	ansi-20040316-freeze:1.1
	postmerge-20040315-windows:1.1
	premerge-20040315-windows:1.1
	windows-20040315-freeze:1.1
	autoconf-20031203:1.1
	autoconf-20031202:1.1
	autoconf-branch:1.1.0.14
	phong-branch:1.1.0.12
	photonmap-branch:1.1.0.10
	rel-6-1-DP:1.1
	windows-branch:1.1.0.8
	rel-6-0-2:1.1
	ansi-branch:1.1.0.6
	rel-6-0-1-branch:1.1.0.4
	hartley-6-0-post:1.1
	hartley-6-0-pre:1.1
	rel-6-0-1:1.1
	rel-6-0:1.1
	rel-5-4:1.1
	offsite-5-3-pre:1.1
	rel-5-3:1.1
	rel-5-2:1.1
	rel-5-1-branch:1.1.0.2
	rel-5-1:1.1;
locks; strict;
comment	@# @;


1.2
date	2004.05.21.17.49.45;	author morrison;	state dead;
branches;
next	1.1;

1.1
date	2000.05.17.14.20.09;	author bparker;	state Exp;
branches;
next	;


desc
@@


1.2
log
@moved to doc/html/
@
text
@<HTML>
<HEAD>
<TITLE>Command History Object Documentation</TITLE>
</HEAD>
<BODY>
<A HREF="#toc">Table of Contents</A><P>
_________________________________________________________________
<P>

<H2><A NAME="sect1" HREF="#toc1"><B>NAME</B></A></H2>
ch_open - create and manipulate a command history object.
<P>

<H2><A NAME="sect2" HREF="#toc2"><B>SYNOPSIS</B></A></H2>
<B>ch_open</B> [<I>chName</I>]
<P>

<H2><A NAME="sect8" HREF="#toc8"><B>DESCRIPTION</B></A></H2>
The <B>ch_open</B> command creates a new command history object
(given by the <I>chName</I> argument).
The <B>ch_open</B> command returns its <I>chName</I> argument.
At the time this command is invoked, there must not exist a
command history object named <I>chName</I>.
<P>

<H2><A NAME="sect9" HREF="#toc9"><B>METHODS</B></A></H2>
The <B>ch_open</B> command creates a new Tcl command whose name
is <I>chName</I>. This command may be used to invoke various
operations on the command history object. It has the following general
form: 
<P>
<I>chName</I> <I>option</I> ?<I>arg</I> <I>arg</I> ...?
<P>
<I>Option</I> and the <I>arg</I>s determine the exact behavior of the command.
The following commands are possible for command history objects:
<P>
<DL>
<DT><I>chName</I> <A NAME="add"><B>add</B></A> <I>command_string</I></DT>
<DD>Add a command to the history and reset the current
command pointer.</DD>
<DT><I>chName</I> <A NAME="curr"><B>curr</B></A></DT>
<DD>Return the current command in the history.</DD>
<DT><I>chName</I> <A NAME="history"><B>history</B></A></DT>
<DD>Return the entire history.</DD>
<DT><I>chName</I> <A NAME="next"><B>next</B></A></DT>
<DD>Return the next command in the history making that
the current command.</DD>
<DT><I>chName</I> <A NAME="prev"><B>prev</B></A></DT>
<DD>Return the previous command in the history making that
the current command.</DD>
<P>
</DL>

<H2><A NAME="sect16" HREF="#toc16"><B>EXAMPLE</B></A></H2>
The following sequence creates a command history object,
adds commands and traverses the history.
<P>
cwish> ch_open ch
<BR>
ch
<BR>
cwish> ch add "cmd1"
<BR>
cwish> ch add "cmd2"
<BR>
cwish> ch prev
<BR>
cmd2
<BR>
cwish> ch prev
<BR>
cmd1
<BR>
cwish> ch curr
<BR>
cmd1
<BR>
cwish> ch add "cmd3"
<BR>
cwish> ch prev
<BR>
cmd3
<BR>
cwish> ch prev
<BR>
cmd2
<BR>
cwish> ch next
<BR>
cmd3
<BR>
cwish> ch next
<BR>
cwish> ch history
<BR>
cmd1
<BR>
cmd2
<BR>
cmd3
<P>

<H2><A NAME="sect17" HREF="#toc17"><B>ACKNOWLEDGEMENTS:</B></A></H2>

Mark L. Ulferts &lt;mulferts@@austin.dsccc.com&gt;
<PRE>        Basic layout for documenting classes.</PRE>
<P>
Glenn Durfee
<PRE>        Original implementation of command history in MGED.</PRE>
<P>

<H2><A NAME="sect18" HREF="#toc18"><B>AUTHOR</B></A></H2>
<P>
Robert G. Parker
<P>

<HR><P>
<A NAME="toc"><B>Table of Contents</B></A><P>
<UL>
<LI><A NAME="toc1" HREF="#sect1">NAME</A></LI>
<LI><A NAME="toc2" HREF="#sect2">SYNOPSIS</A></LI>
<LI><A NAME="toc8" HREF="#sect8">DESCRIPTION</A></LI>
<LI><A NAME="toc9" HREF="#sect9">METHODS</A></LI>
<LI><A NAME="toc16" HREF="#sect16">EXAMPLE</A></LI>
<LI><A NAME="toc17" HREF="#sect17">ACKNOWLEDGEMENTS</A></LI>
<LI><A NAME="toc18" HREF="#sect18">AUTHOR</A></LI>
</UL>
</BODY>
</HTML>
@


1.1
log
@*- Initial check-in of documentation
   for the command history object
@
text
@@

